expense_tracker/jmeter/report/report_k8s_baseline_20251104_141737/statistics.json
{
  "GET Home" : {
    "transaction" : "GET Home",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.019999999999999997,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 51.7491202649555,
    "receivedKBytesPerSec" : 55.99416528669012,
    "sentKBytesPerSec" : 0.0
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.1719999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 51.78663904712584,
    "receivedKBytesPerSec" : 56.33819911962714,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 0.10200000000000015,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 206.88941760628944,
    "receivedKBytesPerSec" : 224.8205072669908,
    "sentKBytesPerSec" : 0.0
  },
  "GET Expenses" : {
    "transaction" : "GET Expenses",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.029999999999999978,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 51.851083687649066,
    "receivedKBytesPerSec" : 56.56021531162501,
    "sentKBytesPerSec" : 0.0
  },
  "POST Add Expense" : {
    "transaction" : "POST Add Expense",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.186,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 51.86721991701245,
    "receivedKBytesPerSec" : 56.3245591286307,
    "sentKBytesPerSec" : 0.0
  }
}