expense_tracker/jmeter/report/report_swarm_baseline_20251106_020903/statistics.json
{
  "GET Add Expense Page" : {
    "transaction" : "GET Add Expense Page",
    "sampleCount" : 397,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2303.7153652392935,
    "medianResTime" : 1004.0,
    "minResTime" : 16.0,
    "maxResTime" : 9302.0,
    "pct1ResTime" : 6573.799999999998,
    "pct2ResTime" : 7754.899999999997,
    "pct3ResTime" : 9020.779999999999,
    "throughput" : 3.1686740256526913,
    "receivedKBytesPerSec" : 12.690168143751647,
    "sentKBytesPerSec" : 0.9801557548946834
  },
  "GET Login Page" : {
    "transaction" : "GET Login Page",
    "sampleCount" : 429,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2638.505827505827,
    "medianResTime" : 1406.0,
    "minResTime" : 2.0,
    "maxResTime" : 11440.0,
    "pct1ResTime" : 8213.0,
    "pct2ResTime" : 9006.0,
    "pct3ResTime" : 10185.599999999999,
    "throughput" : 3.3892948844558566,
    "receivedKBytesPerSec" : 5.590350644380802,
    "sentKBytesPerSec" : 0.9784913218447561
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 418,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6075.399521531106,
    "medianResTime" : 6428.5,
    "minResTime" : 452.0,
    "maxResTime" : 12981.0,
    "pct1ResTime" : 10198.3,
    "pct2ResTime" : 10652.449999999999,
    "pct3ResTime" : 11669.24,
    "throughput" : 3.2634578600148343,
    "receivedKBytesPerSec" : 6.495030765702463,
    "sentKBytesPerSec" : 1.6257362054495061
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1638,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3787.523199023198,
    "medianResTime" : 2899.5,
    "minResTime" : 2.0,
    "maxResTime" : 12981.0,
    "pct1ResTime" : 8998.2,
    "pct2ResTime" : 9688.05,
    "pct3ResTime" : 10833.499999999995,
    "throughput" : 12.782195447415857,
    "receivedKBytesPerSec" : 37.0344488409795,
    "sentKBytesPerSec" : 5.203275766795166
  },
  "POST Add Expense" : {
    "transaction" : "POST Add Expense",
    "sampleCount" : 394,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4106.477157360404,
    "medianResTime" : 3416.5,
    "minResTime" : 15.0,
    "maxResTime" : 10655.0,
    "pct1ResTime" : 8898.5,
    "pct2ResTime" : 9503.5,
    "pct3ResTime" : 10155.550000000001,
    "throughput" : 3.1614844533600803,
    "receivedKBytesPerSec" : 12.970113465396189,
    "sentKBytesPerSec" : 1.7002726930792378
  }
}